{
  "id": 532,
  "title": "Radio trainers in Cape Town",
  "slug": "130120-radio-trainers-in-cape-town-2",
  "body": "<p>Sam and I flew into Cape Town at half eight this morning and were met by Mike Rahfaldt, Executive Director at CRF.&nbsp; He took us on a short tour of the city, starting with a drive past <a href=\"http://en.wikipedia.org/wiki/Khayelitsha\" target=\"\">Khayelitsha</a>, a township by the airport, housing one million people under corrugated iron shacks and stacked small new builds built by the government.<br><br>We joined a training session for 14 youth radio trainers and producers from all over South Africa (pictured above), hosted by Lesedi and Nina from CRF. It was held in a first floor reception room of the <a href=\"http://www.iziko.org.za/static/page/the-history-of-the-building\" target=\"\">Iziko Slave Lodge Museum</a>, formerly the colonial offices and one of the oldest buildings in Cape Town. The trainers had come from radio stations all over South Africa (weâ&#8364; ll be visiting some of them over the next fortnight) and have been here this week to learn and practise different radio techniques, which theyâ&#8364; ll take to their own community radio stations. &nbsp;<br><br>You can hear an interview Samâ&#8364; s just done with youth trainer Babyâ&#8364;\"Girl, from Moutse Community Radio Station in Limpopo. &nbsp;<br></p><p>\r\n<iframe src=\"https://w.soundcloud.com/player/?url=http%3A%2F%2Fapi.soundcloud.com%2Ftracks%2F75732863\" frameborder=\"no\" height=\"166\" scrolling=\"no\" width=\"100%\"></iframe><br>Babyâ&#8364;\"Girl loves working with the young reporters, because they come up with such brilliant new ideas for broadcasts. <br><br>Tomorrow weâ&#8364; re going back to Khayelitsha, this time with all the radio trainers, as they go and interview people living in the township.&nbsp; <br></p>",
  "signature": "Colin",
  "images": [
    {
      "thumb": "https://rsrc.wasteheadquarters.com/ZjQxM2JmYTdjYmM4ZmZmNjMzNDdkMjZk/c/IMG_2134-thumb.jpg",
      "url": "https://rsrc.wasteheadquarters.com/ZjQxM2JmYTdjYmM4ZmZmNjMzNDdkMjZk/IMG_2134.JPG",
      "name": null,
      "r": ""
    },
    {
      "thumb": "https://rsrc.wasteheadquarters.com/NjAyNjQ3YjVmNmJlNmM2MmRhMGZhMjFm/c/IMG_2148-thumb.jpg",
      "url": "https://rsrc.wasteheadquarters.com/NjAyNjQ3YjVmNmJlNmM2MmRhMGZhMjFm/IMG_2148.JPG",
      "name": null,
      "r": ""
    }
  ],
  "date": "Sun, 20th January 2013"
}