{
  "id": 479,
  "title": "Hello Fluffy",
  "slug": "111021-hello-fluffy",
  "body": "<br>The <a class='bol' target='_blank' href=\"http://www.bbc.co.uk/news/science-environment-15373071\">Berkeley Earth Project</a> has concluded that the Earth is definitely warming.. <br>Set up after a bizarre last ditch campaign to question/sabotage the science of global warming in 2009 around 'climategate' this further undermines those who continue to tell us what we'd like to hear, that it ain't real and there's nothing to be done. <br>Will it draw a big black thick line under this guff so that we can finally and seriously move on and start to change the way our world functions????<br><br><br><br>\"meanwhile ..\"<br><br>here's some music... <br><br>1. Popgun    by Martyn<br>2. Walla Illa (feat. Tunde Adebimpe)    by Tinariwen<br>3. Digimon    by Dj Diamond<br>4. Boudler Holder    by Madvillian<br>5. Here Come the Warm Jets   by Brian Eno<br>6. Magic Says   by  Dabrye<br>7. Cosmogony  by Bjork<br>8. Bangin   by Si Begg<br>9. look at stars (Machinedrum rmx)   by  SbtrkT<br>10. Stomp Yo feet (part1)   by  Theo Parrish<br><br><br><br><br>Chosen for and WARMLY dedicated to the brave souls PEACEFULLY sleeping on concrete OCCUPYing Wall Street and the City and elsewhere in the world, <br>attempting to express the anger and disgust most humans feel for the institutions that have failed to serve the needs of all but a few of the human beings of this planet.  <br>Now yet those same institutions demand that we bail them out and in so doing sacrifice our own and our children's chances of a reasonable and safe financial future. <br><br>'Bangin Motherfuckers........'<br><br>now i need to go and do something fluffy<br>:)<br><br>",
  "signature": "Thom",
  "images": [
    {
      "thumb": "https://rsrc.wasteheadquarters.com/NzE4YzZhZGU3NGVkNzEzMWVkNTE1Mjkx/c/_56174211_climate_change_624gr-thumb.jpg",
      "url": "https://rsrc.wasteheadquarters.com/NzE4YzZhZGU3NGVkNzEzMWVkNTE1Mjkx/_56174211_climate_change_624gr.gif",
      "name": null,
      "r": ""
    }
  ],
  "date": "Fri, 21st October 2011"
}