{
  "id": 391,
  "title": "not finished",
  "slug": "091218-not-finished",
  "body": "Hello. I arrived at the copenhagen summit yesterday afternoon. <br>I felt compelled to come to find some hope from these talks. for our kids and theirs. judge that as you will.<br>i camewith a friend of mine Tony Juniper ( He was previously head of Friends of the Earth when i was involved with them  to get the climate bill passed in the UK. a Framed copy of which i have on my wall at home. ) So is there any? well yesterday there seemed to be.<br>the first person i met was the famous john vidal from the guardian who said things were moving again. then we talked to others who said the same. got technical for a bit most of which i can follow but i get lost on the forest stuff and still can't piece together how you can have a kyoto style agreement and another for america et all running at the same time. but then i sat in on a uk press briefing with Ed Miliband. and he made things clear in some ways.<br>yesterday there is a lot of brinksmanship, the americans offering money seemed. but no-one was talking 40 percent cuts by 2020. and the negotiations had an obvious G8 vibe about them. the west dictating terms and bizarrely assuming that the science could be bartered.. !!! arguing about who cuts what??? that somehow the amount we have to cut our emissions is negotiable?? what a crock of shit. may i humbly suggest that we remove the professional negotiators who seem to relish the negotiations for their own sake. miliband talked about  a hundred square brackets in the document waiting to be filled.<br> it feels like the developed countries are trying to wrestle some sort of business as usual out of this. despite huge domestic and global political pressure. and the imminent demise of life on earth.<br>these cuts are non negotiable, they are the facts. it is not surprising that the developing countries find this difficult to stomach and sign up too. that and the mysterious lack of transparency to the process.<br><br>what is frustrating so far is americas attitude. hilary clintons speech was apparently still trying to shift responsibilty for emissions around... which is just frankly nuts. <br>obama said nothing though i have not seen all the speech yet. i feel very sad for all americans i know who hold so much hope for this man. still.. i guess the day isnt over. its 3pm on friday ( though it should have finished by now). and our leaders are fully aware they are in disgrace. and fully aware that they cannot draw up an agreement and force it upon us all without us immediatley seeing the holes in it.<br><br>the atmosphere here is deepy distressing at the moment though, with many of the suits obviously puzzling how to make this look good how to spin something positive. <br>frankly they should have kept all the NGOs in here. throwing them out was an absolute disgrace..  ( though some are now back in )right now they should tearing this place apart with their bare hands, registering the utter disgust that the rest of the world will feel if today ends like this. and i say if. there is a prayer and meditation room here. i may have to go and sit it and dodge all these cameras.<br><br>tony just told me a bunch of latin american countries just walked out. at least someone is registering their anger here. people are being too reasonable.",
  "signature": "Thom",
  "images": [
    {
      "thumb": "https://rsrc.wasteheadquarters.com/YmZiMWEwODkzNGZmNTg5OTNkODJkZTY1/c/me-and-tony-thumb.jpg",
      "url": "https://rsrc.wasteheadquarters.com/YmZiMWEwODkzNGZmNTg5OTNkODJkZTY1/me-and-tony.jpg",
      "name": null,
      "r": ""
    },
    {
      "thumb": "https://rsrc.wasteheadquarters.com/NDQ3ZGJlNDA5NTRmMDgyMzFjY2VjMmY4/c/the-empty-NGO-area..-your-voice-thumb.jpg",
      "url": "https://rsrc.wasteheadquarters.com/NDQ3ZGJlNDA5NTRmMDgyMzFjY2VjMmY4/the-empty-NGO-area..-your-voice.jpg",
      "name": null,
      "r": ""
    },
    {
      "thumb": "https://rsrc.wasteheadquarters.com/ZGQ0ZDc3YWRjZmEyZTdjMDRhNWM3MjUz/c/US-pR-HQ-empty-but-nice-lights-thumb.jpg",
      "url": "https://rsrc.wasteheadquarters.com/ZGQ0ZDc3YWRjZmEyZTdjMDRhNWM3MjUz/US-pR-HQ-empty-but-nice-lights.jpg",
      "name": null,
      "r": ""
    },
    {
      "thumb": "https://rsrc.wasteheadquarters.com/NzhhNjliMWE3YzgyMmI1YmZmYjViOGM3/c/civil-society-thumb.jpg",
      "url": "https://rsrc.wasteheadquarters.com/NzhhNjliMWE3YzgyMmI1YmZmYjViOGM3/civil-society.jpg",
      "name": null,
      "r": ""
    },
    {
      "thumb": "https://rsrc.wasteheadquarters.com/OTRiY2VjMWRmMWQzM2EyNTRjNGVkZjlh/c/the-end-of-thursday-thumb.jpg",
      "url": "https://rsrc.wasteheadquarters.com/OTRiY2VjMWRmMWQzM2EyNTRjNGVkZjlh/the-end-of-thursday.jpg",
      "name": null,
      "r": ""
    },
    {
      "thumb": "https://rsrc.wasteheadquarters.com/OGZlMjkyYTdiNGNjY2FmNTZiODY2NTAz/c/tear-this-down-in-disgust-thumb.jpg",
      "url": "https://rsrc.wasteheadquarters.com/OGZlMjkyYTdiNGNjY2FmNTZiODY2NTAz/tear-this-down-in-disgust.jpg",
      "name": null,
      "r": ""
    }
  ],
  "date": "Fri, 18th December 2009"
}